GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_uart.h
/**
  * @brief    Get U7816 Parity
  * @rmtoll   FFCR    PAR    FL_UART_GetU7816Parity
  * @param    UARTx UART instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_UART_U7816_PARITY_SEL_EVEN
  *           @arg @ref FL_UART_U7816_PARITY_SEL_ODD
  *           @arg @ref FL_UART_U7816_PARITY_SEL_ALWAYS_1
  *           @arg @ref FL_UART_U7816_PARITY_SEL_NONE
  */
__STATIC_INLINE uint32_t FL_UART_GetU7816Parity(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->FFCR, UART_FFCR_PAR_Msk));
}

/**
  * @brief    Set U7816 RX Guard Time Length
  * @rmtoll   FFCR    RFREN    FL_UART_SetU7816RXGuardTime
  * @param    UARTx UART instance
  * @param    config This parameter can be one of the following values:
  *           @arg @ref FL_UART_U7816_RX_GUARD_TIME_2ETU
  *           @arg @ref FL_UART_U7816_RX_GUARD_TIME_1ETU
  * @retval   None
  */
__STATIC_INLINE void FL_UART_SetU7816RXGuardTime(UART_Type *UARTx, uint32_t config)
{
    MODIFY_REG(UARTx->FFCR, UART_FFCR_RFREN_Msk, config);
}

/**
  * @brief    Get U7816 RX Guard Time Length
  * @rmtoll   FFCR    RFREN    FL_UART_GetU7816RXGuardTime
  * @param    UARTx UART instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_UART_U7816_RX_GUARD_TIME_2ETU
  *           @arg @ref FL_UART_U7816_RX_GUARD_TIME_1ETU
  */
__STATIC_INLINE uint32_t FL_UART_GetU7816RXGuardTime(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->FFCR, UART_FFCR_RFREN_Msk));
}

/**
  * @brief    Set U7816 TX Auto Retry When Parity Error Occurred
  * @rmtoll   FFCR    TREPEN    FL_UART_EnableU7816TXParityErrorAutoRetry
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_EnableU7816TXParityErrorAutoRetry(UART_Type *UARTx)
{
    SET_BIT(UARTx->FFCR, UART_FFCR_TREPEN_Msk);
}

/**
  * @brief    Get U7816 TX Auto Retry When Parity Error Occurred
  * @rmtoll   FFCR    TREPEN    FL_UART_DisableU7816TXParityErrorAutoRetry
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_DisableU7816TXParityErrorAutoRetry(UART_Type *UARTx)
{
    CLEAR_BIT(UARTx->FFCR, UART_FFCR_TREPEN_Msk);
}

/**
  * @brief    Get U7816 TX Auto Retry When Parity Error Occurred
  * @rmtoll   FFCR    TREPEN    FL_UART_U7816IsEnabledTXParityErrorAutoRetry
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_U7816IsEnabledTXParityErrorAutoRetry(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->FFCR, UART_FFCR_TREPEN_Msk) == UART_FFCR_TREPEN_Msk);
}

/**
  * @brief    Get U7816 RX Auto Retry When Parity Error Occurred
  * @rmtoll   FFCR    RREPEN    FL_UART_EnableU7816RXParityErrorAutoRetry
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_EnableU7816RXParityErrorAutoRetry(UART_Type *UARTx)
{
    SET_BIT(UARTx->FFCR, UART_FFCR_RREPEN_Msk);
}

/**
  * @brief    Get U7816 RX Auto Retry When Parity Error Occurred
  * @rmtoll   FFCR    RREPEN    FL_UART_DisableU7816RXParityErrorAutoRetry
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_DisableU7816RXParityErrorAutoRetry(UART_Type *UARTx)
{
    CLEAR_BIT(UARTx->FFCR, UART_FFCR_RREPEN_Msk);
}

/**
  * @brief    Get U7816 RX Auto Retry When Parity Error Occurred
  * @rmtoll   FFCR    RREPEN    FL_UART_U7816IsEnabledRXParityErrorAutoRetry
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_U7816IsEnabledRXParityErrorAutoRetry(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->FFCR, UART_FFCR_RREPEN_Msk) == UART_FFCR_RREPEN_Msk);
}

/**
  * @brief    Set U7816 Bit Order
  * @rmtoll   FFCR    DICONV    FL_UART_SetU7816BitOrder
  * @param    UARTx UART instance
  * @param    order This parameter can be one of the following values:
  *           @arg @ref FL_UART_U7816_BIT_ORDER_LSB_FIRST
  *           @arg @ref FL_UART_U7816_BIT_ORDER_MSB_FIRST
  * @retval   None
  */
__STATIC_INLINE void FL_UART_SetU7816BitOrder(UART_Type *UARTx, uint32_t order)
{
    MODIFY_REG(UARTx->FFCR, UART_FFCR_DICONV_Msk, order);
}

/**
  * @brief    Get U7816 Bit Order
  * @rmtoll   FFCR    DICONV    FL_UART_GetU7816BitOrder
  * @param    UARTx UART instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_UART_U7816_BIT_ORDER_LSB_FIRST
  *           @arg @ref FL_UART_U7816_BIT_ORDER_MSB_FIRST
  */
__STATIC_INLINE uint32_t FL_UART_GetU7816BitOrder(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->FFCR, UART_FFCR_DICONV_Msk));
}

/**
  * @brief    Set U7816 Extra Guard Time
  * @rmtoll   EGTR        FL_UART_WriteU7816ExtraGuardTime
  * @param    UARTx UART instance
  * @param    config
  * @retval   None
  */
__STATIC_INLINE void FL_UART_WriteU7816ExtraGuardTime(UART_Type *UARTx, uint32_t config)
{
    MODIFY_REG(UARTx->EGTR, (0xffU << 0U), (config << 0U));
}

/**
  * @brief    Get U7816 Extra Guard Time
  * @rmtoll   EGTR        FL_UART_ReadU7816ExtraGuardTime
  * @param    UARTx UART instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_UART_ReadU7816ExtraGuardTime(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->EGTR, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Set U7816 Clock Divide
  * @rmtoll   CODR        FL_UART_WriteU7816ClockDivision
  * @param    UARTx UART instance
  * @param    div
  * @retval   None
  */
__STATIC_INLINE void FL_UART_WriteU7816ClockDivision(UART_Type *UARTx, uint32_t div)
{
    MODIFY_REG(UARTx->CODR, (0x1fU << 0U), (div << 0U));
}

/**
  * @brief    Get U7816 Clock Divide
  * @rmtoll   CODR        FL_UART_ReadU7816ClockDivision
  * @param    UARTx UART instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_UART_ReadU7816ClockDivision(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->CODR, (0x1fU << 0U)) >> 0U);
}

/**
  * @brief    Disable U7816 Receive Complete Interrupt
  * @rmtoll   SCIER    RXIE    FL_UART_DisableIT_U7816RXComplete
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_DisableIT_U7816RXComplete(UART_Type *UARTx)
{
    CLEAR_BIT(UARTx->SCIER, UART_SCIER_RXIE_Msk);
}

/**
  * @brief    Enable U7816 Receive Complete Interrupt
  * @rmtoll   SCIER    RXIE    FL_UART_EnableIT_U7816RXComplete
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_EnableIT_U7816RXComplete(UART_Type *UARTx)
{
    SET_BIT(UARTx->SCIER, UART_SCIER_RXIE_Msk);
}

/**
  * @brief    Get U7816 Receive Complete Interrupt Enable Status
  * @rmtoll   SCIER    RXIE    FL_UART_IsEnabledIT_U7816RXComplete
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsEnabledIT_U7816RXComplete(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCIER, UART_SCIER_RXIE_Msk) == UART_SCIER_RXIE_Msk);
}

/**
  * @brief    Disable U7816 Transmit Complete Interrupt
  * @rmtoll   SCIER    TXIE    FL_UART_DisableIT_U7816TXComplete
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_DisableIT_U7816TXComplete(UART_Type *UARTx)
{
    CLEAR_BIT(UARTx->SCIER, UART_SCIER_TXIE_Msk);
}

/**
  * @brief    Enable U7816 Transmit Complete Interrupt
  * @rmtoll   SCIER    TXIE    FL_UART_EnableIT_U7816TXComplete
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_EnableIT_U7816TXComplete(UART_Type *UARTx)
{
    SET_BIT(UARTx->SCIER, UART_SCIER_TXIE_Msk);
}

/**
  * @brief    Disable U7816 Line Status Interrupt
  * @rmtoll   SCIER    LSIE    FL_UART_DisableIT_U7816Error
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_DisableIT_U7816Error(UART_Type *UARTx)
{
    CLEAR_BIT(UARTx->SCIER, UART_SCIER_LSIE_Msk);
}

/**
  * @brief    Enable U7816 Line Status Interrupt
  * @rmtoll   SCIER    LSIE    FL_UART_EnableIT_U7816Error
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_EnableIT_U7816Error(UART_Type *UARTx)
{
    SET_BIT(UARTx->SCIER, UART_SCIER_LSIE_Msk);
}

/**
  * @brief    Get U7816 Line Status Interrupt Enable Status
  * @rmtoll   SCIER    LSIE    FL_UART_IsEnabledIT_U7816Error
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsEnabledIT_U7816Error(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCIER, UART_SCIER_LSIE_Msk) == UART_SCIER_LSIE_Msk);
}

/**
  * @brief    Get U7816 Waiting for Retry Flag
  * @rmtoll   SCISR    WAIT_RPT    FL_UART_IsActiveFlag_U7816WaitRetry
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsActiveFlag_U7816WaitRetry(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCISR, UART_SCISR_WAIT_RPT_Msk) == (UART_SCISR_WAIT_RPT_Msk));
}

/**
  * @brief    Get U7816 Transmission Busy Flag
  * @rmtoll   SCISR    TXBUSY    FL_UART_IsActiveFlag_U7816TXBusy
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsActiveFlag_U7816TXBusy(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCISR, UART_SCISR_TXBUSY_Msk) == (UART_SCISR_TXBUSY_Msk));
}

/**
  * @brief    Get U7816 Receivement Busy Flag
  * @rmtoll   SCISR    RXBUSY    FL_UART_IsActiveFlag_U7816RXBusy
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsActiveFlag_U7816RXBusy(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCISR, UART_SCISR_RXBUSY_Msk) == (UART_SCISR_RXBUSY_Msk));
}

/**
  * @brief    Get U7816 Transmit Parity Error Flag
  * @rmtoll   SCISR    TPARERR    FL_UART_IsActiveFlag_U7816TXParityError
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsActiveFlag_U7816TXParityError(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCISR, UART_SCISR_TPARERR_Msk) == (UART_SCISR_TPARERR_Msk));
}

/**
  * @brief    Clear U7816 Transmit Parity Error Flag
  * @rmtoll   SCISR    TPARERR    FL_UART_ClearFlag_U7816TXParityError
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_ClearFlag_U7816TXParityError(UART_Type *UARTx)
{
    WRITE_REG(UARTx->SCISR, UART_SCISR_TPARERR_Msk);
}

/**
  * @brief    Get U7816 Receive Parity Error Flag
  * @rmtoll   SCISR    RPARERR    FL_UART_IsActiveFlag_U7816RXParityError
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsActiveFlag_U7816RXParityError(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCISR, UART_SCISR_RPARERR_Msk) == (UART_SCISR_RPARERR_Msk));
}

/**
  * @brief    Clear U7816 Receive Parity Error Flag
  * @rmtoll   SCISR    RPARERR    FL_UART_ClearFlag_U7816RXParityError
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_ClearFlag_U7816RXParityError(UART_Type *UARTx)
{
    WRITE_REG(UARTx->SCISR, UART_SCISR_RPARERR_Msk);
}

/**
  * @brief    Get U7816 Receive Frame Error Flag
  * @rmtoll   SCISR    FRERR    FL_UART_IsActiveFlag_U7816RXFrameError
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsActiveFlag_U7816RXFrameError(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCISR, UART_SCISR_FRERR_Msk) == (UART_SCISR_FRERR_Msk));
}

/**
  * @brief    Clear U7816 Receive Frame Error Flag
  * @rmtoll   SCISR    FRERR    FL_UART_ClearFlag_U7816RXFrameError
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_ClearFlag_U7816RXFrameError(UART_Type *UARTx)
{
    WRITE_REG(UARTx->SCISR, UART_SCISR_FRERR_Msk);
}

/**
  * @brief    Get U7816 Receive Overflow Error Flag
  * @rmtoll   SCISR    OVERR    FL_UART_IsActiveFlag_U7816RXOverflow
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsActiveFlag_U7816RXOverflow(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCISR, UART_SCISR_OVERR_Msk) == (UART_SCISR_OVERR_Msk));
}

/**
  * @brief    Clear U7816 Receive Overflow Error Flag
  * @rmtoll   SCISR    OVERR    FL_UART_ClearFlag_U7816RXOverflow
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void FL_UART_ClearFlag_U7816RXOverflow(UART_Type *UARTx)
{
    WRITE_REG(UARTx->SCISR, UART_SCISR_OVERR_Msk);
}

/**
  * @brief    Get U7816 Receive Complete Flag
  * @rmtoll   SCISR    RXIF    FL_UART_IsActiveFlag_U7816RXComplete
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsActiveFlag_U7816RXComplete(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCISR, UART_SCISR_RXIF_Msk) == (UART_SCISR_RXIF_Msk));
}

/**
  * @brief    Get U7816 Transmit Buffer Empty Flag
  * @rmtoll   SCISR    TXIF    FL_UART_IsActiveFlag_U7816TXBuffEmpty
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsActiveFlag_U7816TXBuffEmpty(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCISR, UART_SCISR_TXIF_Msk) == (UART_SCISR_TXIF_Msk));
}

/**
  * @brief    Get U7816 Error Flag
  * @rmtoll   SCISR    ERRIF    FL_UART_IsActiveFlag_U7816Error
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_UART_IsActiveFlag_U7816Error(UART_Type *UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->SCISR, UART_SCISR_ERRIF_Msk) == (UART_SCISR_ERRIF_Msk));
}

/**
  * @}
  */

/** @defgroup UART_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_UART_DeInit(UART_Type *UARTx);
FL_ErrorStatus FL_UART_Init(UART_Type *UARTx, FL_UART_InitTypeDef *initStruct);
FL_ErrorStatus FL_UART_InfraRed_Init(UART_Type *UARTx, FL_UART_InfraRed_InitTypeDef *initStruct);
void FL_UART_InfraRed_StructInit(FL_UART_InfraRed_InitTypeDef *initStruct);
void FL_UART_StructInit(FL_UART_InitTypeDef *initStruct);

FL_ErrorStatus FL_U7816_DeInit(UART_Type *UARTx);
FL_ErrorStatus FL_U7816_Init(UART_Type *UARTx, FL_UART_U7816_InitTypeDef *U7816_InitStruct);
void FL_U7816_StructInit(FL_UART_U7816_InitTypeDef *U7816_InitStruct);
FL_ErrorStatus FL_UART_LIN_Init(UART_Type *UARTx, FL_UART_LIN_InitTypeDef *initStruct);
void FL_UART_LIN_StructInit(FL_UART_LIN_InitTypeDef *initStruct);
/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LR0XX_FL_UART_H*/


/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
